<?php
//别名
select * from stu;
select name from stu;//查询单一一列
select name as n from stu;//查询单一一列，别名
select name as '姓名' from stu;//查询单一一列，别名
select name s from stu;//查询单一一列，别名


/**
 * where条件
 */
//查询所有同学
mysql> select * from stu;
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   1 | 李万里    | 男  |   18 |
|   2 | 于子敬    | 男  |   20 |
|   3 | 刘捷豪    | 男  |   30 |
|   4 | 赵全      | 男  |   40 |
|   5 | 陈鹏      | 女  |   18 |
|   6 | 苏启海    | 女  |   20 |
+-----+-----------+-----+------+
//查看stu表中男生
select * from stu where sex='男';
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   1 | 李万里    | 男  |   18 |
|   2 | 于子敬    | 男  |   20 |
|   3 | 刘捷豪    | 男  |   30 |
|   4 | 赵全      | 男  |   40 |
+-----+-----------+-----+------+
//年龄>20岁的同学
select * from stu where age>20;
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   3 | 刘捷豪    | 男  |   30 |
|   4 | 赵全      | 男  |   40 |
+-----+-----------+-----+------+
//查找年龄>18岁的女同学
select * from stu where age>18 and sex='女';
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   6 | 苏启海    | 女  |   20 |
+-----+-----------+-----+------+
//查找年龄>18或者是女同学
select * from stu where age>18 or sex='女';
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   2 | 于子敬    | 男  |   20 |
|   3 | 刘捷豪    | 男  |   30 |
|   4 | 赵全      | 男  |   40 |
|   5 | 陈鹏      | 女  |   18 |
|   6 | 苏启海    | 女  |   20 |
+-----+-----------+-----+------+

/**
 * 连接concat
 */
select name from stu;
select concat(name,sex) from stu;
+------------------+
| concat(name,sex) |
+------------------+
| 李万里男         |
| 于子敬男         |
| 刘捷豪男         |
| 赵全男           |
| 陈鹏女           |
| 苏启海女         |
+------------------+
select concat(name,'|',sex) from stu;
+----------------------+
| concat(name,'|',sex) |
+----------------------+
| 李万里|男            |
| 于子敬|男            |
| 刘捷豪|男            |
| 赵全|男              |
| 陈鹏|女              |
| 苏启海|女            |
+----------------------+
select concat(name,'|',sex) as c from stu;
+---------------+
| c             |
+---------------+
| 李万里|男     |
| 于子敬|男     |
| 刘捷豪|男     |
| 赵全|男       |
| 陈鹏|女       |
| 苏启海|女     |
+---------------+

	/**
	 * 查询结果自身比较
	 */
select age,age>18  from stu;
+------+--------+
| age  | age>18 |
+------+--------+
|   18 |      0 |
|   20 |      1 |
|   30 |      1 |
|   40 |      1 |
|   18 |      0 |
|   20 |      1 |
+------+--------+
select age,age>18 as b from stu;
+------+------+
| age  | b    |
+------+------+
|   18 |    0 |
|   20 |    1 |
|   30 |    1 |
|   40 |    1 |
|   18 |    0 |
|   20 |    1 |
+------+------+

/**
 * distinct,过滤,去重
 */
select distinct sex from stu;

/**
 * 判断数据值是否为空
 */
select * from stu where name is null;
+-----+------+-----+------+
| uid | name | sex | age  |
+-----+------+-----+------+
|   9 | NULL | 女  |    0 |
+-----+------+-----+------+
mysql> select * from stu where name is not null;
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   1 | 李万里    | 男  |   18 |
|   2 | 于子敬    | 男  |   20 |
|   3 | 刘捷豪    | 男  |   30 |
|   4 | 赵全      | 男  |   40 |
|   5 | 陈鹏      | 女  |   18 |
|   6 | 苏启海    | 女  |   20 |
|   7 | null      | 男  |    0 |
|   8 |           | 男  |   20 |
+-----+-----------+-----+------+

/**
 * if
 */
mysql> select age,if(age>18,'大','小') as bigger from stu;
+------+--------+
| age  | bigger |
+------+--------+
|   18 | 小     |
|   20 | 大     |
|   30 | 大     |
|   40 | 大     |
|   18 | 小     |
|   20 | 大     |
|    0 | 小     |
|   20 | 大     |
|    0 | 小     |
+------+--------+

/**
 * ifnull
 */
mysql> select age,ifnull(name,'空') from stu;
+------+--------------------+
| age  | ifnull(name,'空')  |
+------+--------------------+
|   18 | 李万里             |
|   20 | 于子敬             |
|   30 | 刘捷豪             |
|   40 | 赵全               |
|   18 | 陈鹏               |
|   20 | 苏启海             |
|    0 | null               |
|   20 |                    |
|    0 | 空                 |
+------+--------------------+


/**
 * 排序 order by
 */
select * from stu order by age;//升序排列
select * from stu order by age asc;//升序排列
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   7 | null      | 男  |    0 |
|   9 | NULL      | 女  |    0 |
|   1 | 李万里    | 男  |   18 |
|   5 | 陈鹏      | 女  |   18 |
|   2 | 于子敬    | 男  |   20 |
|   6 | 苏启海    | 女  |   20 |
|   8 |           | 男  |   20 |
|   3 | 刘捷豪    | 男  |   30 |
|   4 | 赵全      | 男  |   40 |
+-----+-----------+-----+------+
select * from stu order by age desc;
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   4 | 赵全      | 男  |   40 |
|   3 | 刘捷豪    | 男  |   30 |
|   2 | 于子敬    | 男  |   20 |
|   6 | 苏启海    | 女  |   20 |
|   8 |           | 男  |   20 |
|   1 | 李万里    | 男  |   18 |
|   5 | 陈鹏      | 女  |   18 |
|   7 | null      | 男  |    0 |
|   9 | NULL      | 女  |    0 |
+-----+-----------+-----+------+
//两个字段进行排序
mysql> select * from stu order by age desc,uid desc;
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   4 | 赵全      | 男  |   40 |
|   3 | 刘捷豪    | 男  |   30 |
|   8 |           | 男  |   20 |
|   6 | 苏启海    | 女  |   20 |
|   2 | 于子敬    | 男  |   20 |
|   5 | 陈鹏      | 女  |   18 |
|   1 | 李万里    | 男  |   18 |
|   9 | NULL      | 女  |    0 |
|   7 | null      | 男  |    0 |
+-----+-----------+-----+------+

/**
 * limit 截取
 */
//php获取数据库数据，数据结构
[
	[
		'uid'=>1,
		'name'=>'李万里',
		'sex'=>'男',
		'age'=>10,
	],
	[
		'uid'=>2,
		'name'=>'于子敬',
		'sex'=>'男',
		'age'=>10,
	]
];
//获取数据中前三条数据
mysql> select * from stu limit 3;
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   1 | 李万里    | 男  |   18 |
|   2 | 于子敬    | 男  |   20 |
|   3 | 刘捷豪    | 男  |   30 |
+-----+-----------+-----+------+
mysql> select * from stu limit 3,3;
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   4 | 赵全      | 男  |   40 |
|   5 | 陈鹏      | 女  |   18 |
|   6 | 苏启海    | 女  |   20 |
+-----+-----------+-----+------+

/**
 * 练习，获取年龄最大的三个人
 */
select * from stu order by age desc limit 3;
mysql> select * from stu order by age desc limit 3;
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   4 | 赵全      | 男  |   40 |
|   3 | 刘捷豪    | 男  |   30 |
|   2 | 于子敬    | 男  |   20 |
+-----+-----------+-----+------+

/**
 * 查找年龄最大三个男生
 */
select * from stu where sex='男' order by age desc limit 3;
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   3 | 刘捷豪    | 男  |   30 |
|   2 | 于子敬    | 男  |   20 |
|   8 |           | 男  |   20 |
+-----+-----------+-----+------+

/**
 * between a and b 在两者之间【包含边界】
 */
select * from stu where age between 20 and 40;
select * from stu where age>=20 and age<=40;
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   2 | 于子敬    | 男  |   20 |
|   3 | 刘捷豪    | 男  |   30 |
|   4 | 赵全      | 女  |   40 |
|   6 | 苏启海    | 女  |   20 |
|   8 |           | 男  |   20 |
+-----+-----------+-----+------+

/**
 * in()在....里面
 */
mysql> select * from stu where age in (30,20,40);
+-----+-----------+-----+------+
| uid | name      | sex | age  |
+-----+-----------+-----+------+
|   2 | 于子敬    | 男  |   20 |
|   3 | 刘捷豪    | 男  |   30 |
|   4 | 赵全      | 女  |   40 |
|   6 | 苏启海    | 女  |   20 |
|   8 |           | 男  |   20 |
+-----+-----------+-----+------+

/**
 * not between()
 * not in()
 * 自己下去多练习
 */

/**
 * like 模糊匹配
 */
select * from stu where name like "%李%";//查找姓名中有李
select * from stu where name like "李%";//查找姓李的所有同学
select * from stu where name like "%李";//查找name以李结尾的数据

//_代表一个字符
select * from stu where name like "_李_";

/**
 * 字符截取
 */
mysql> select left(name,2) from stu;
+--------------+
| left(name,2) |
+--------------+
| 李万         |
| 于子         |
| 刘捷         |
| 赵全         |
| 陈鹏         |
| 苏启         |
| nu           |
|              |
| NULL         |
| 小李         |
+--------------+
mysql> select mid(name,2,2) from stu;
+---------------+
| mid(name,2,2) |
+---------------+
| 万里          |
| 子敬          |
| 捷豪          |
| 全            |
| 鹏            |
| 启海          |
| ul            |
|               |
| NULL          |
| 李            |
+---------------+
mysql> select right(name,1) from stu;
+---------------+
| right(name,1) |
+---------------+
| 里            |
| 敬            |
| 豪            |
| 全            |
| 鹏            |
| 海            |
| l             |
|               |
| NULL          |
| 李            |
+---------------+



/**
 * rand()随机
 */
select * from stu order by rand();
//随机获取3条同学数据
select * from stu order by rand() limit 3;




















